emacs/configs/documentation/03-md.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf7aefd5">1. Introduction</a></li>
<li><a href="#orgd9cbe0d">2. Markdown Mode</a></li>
<li><a href="#org4e2bfee">3. Table of Contents</a></li>
<li><a href="#org8b26289">4. Org Table Integration</a></li>
<li><a href="#org33b08d5">5. Live GitHub Preview</a></li>
<li><a href="#org7155f6b">6. End of File</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf7aefd5" class="outline-2">
<h2 id="orgf7aefd5"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This configuration sets up a complete Markdown editing environment in Emacs with support for GitHub-Flavored Markdown, table of contents generation, live preview, and distraction-free writing.
</p>
</div>
</div>

<div id="outline-container-orgd9cbe0d" class="outline-2">
<h2 id="orgd9cbe0d"><span class="section-number-2">2.</span> Markdown Mode</h2>
<div class="outline-text-2" id="text-2">
<p>
The <code>markdown-mode</code> package provides comprehensive support for editing Markdown files with syntax highlighting, live preview, and convenient keybindings.
</p>

<p>
Key features:
</p>
<ul class="org-ul">
<li>GitHub-Flavored Markdown (GFM) support for README files</li>
<li>Native syntax highlighting for code blocks</li>
<li>WikiLinks support for internal linking</li>
<li>Scalable headers for better visual hierarchy</li>
<li>Custom keybindings: <code>C-c C-e</code> for markdown-do and <code>C-c C-t</code> for TOC generation</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> markdown-mode
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:mode</span> (<span class="org-string">"README\\.md\\'"</span> . gfm-mode) <span class="org-comment-delimiter">;; </span><span class="org-comment">Use GitHub-Flavored Markdown for READMEs
</span>  <span class="org-builtin">:init</span> (<span class="org-keyword">setq</span> markdown-command <span class="org-string">"multimarkdown"</span>)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> markdown-mode-map
                        (<span class="org-string">"C-c C-e"</span> . markdown-do)
                        (<span class="org-string">"C-c C-t"</span> . markdown-toc-generate-or-refresh-toc))
  <span class="org-builtin">:custom</span>
  (markdown-header-scaling t)             <span class="org-comment-delimiter">;; </span><span class="org-comment">Make headers look bigger
</span>  (markdown-enable-wiki-links t)          <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable [[WikiLinks]] support
</span>  (markdown-italic-underscore t)          <span class="org-comment-delimiter">;; </span><span class="org-comment">Use _italics_ by default
</span>  (markdown-fontify-code-blocks-natively t) <span class="org-comment-delimiter">;; </span><span class="org-comment">Syntax highlight code blocks
</span>  (markdown-gfm-use-electric-backquote nil) <span class="org-comment-delimiter">;; </span><span class="org-comment">Disable electric backticks if annoying
</span>  <span class="org-builtin">:hook</span>
  ((markdown-mode . olivetti-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e2bfee" class="outline-2">
<h2 id="org4e2bfee"><span class="section-number-2">3.</span> Table of Contents</h2>
<div class="outline-text-2" id="text-3">
<p>
The <code>markdown-toc</code> package automatically generates and updates table of contents in Markdown files. Use <code>C-c C-t</code> (bound above) to insert or refresh the TOC based on your headers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> markdown-toc
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:after</span> markdown-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b26289" class="outline-2">
<h2 id="org8b26289"><span class="section-number-2">4.</span> Org Table Integration</h2>
<div class="outline-text-2" id="text-4">
<p>
This integration enables Org-mode's powerful table editor within Markdown files. When editing Markdown tables, you can use <code>TAB</code> to navigate between cells and automatically format tables, just like in Org-mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Use Org-mode's powerful table editor inside Markdown
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">This allows you to use TAB to navigate/format tables automatically.
</span>(<span class="org-keyword">use-package</span> markdown-mode
  <span class="org-builtin">:hook</span> (markdown-mode . orgtbl-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org33b08d5" class="outline-2">
<h2 id="org33b08d5"><span class="section-number-2">5.</span> Live GitHub Preview</h2>
<div class="outline-text-2" id="text-5">
<p>
The <code>grip-mode</code> package provides live preview of Markdown files as they would appear on GitHub. It uses the GitHub Markdown API to render your files in real-time. Toggle the preview with <code>C-c C-p</code>.
</p>

<p>
Note: grip-mode requires the <code>grip</code> Python package to be installed (<code>pip install grip</code> or just <code>brew install grip</code> on macOS).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> grip-mode
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> markdown-mode-map
         (<span class="org-string">"C-c C-p"</span> . grip-mode))) <span class="org-comment-delimiter">;; </span><span class="org-comment">Toggle preview with C-c C-p</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7155f6b" class="outline-2">
<h2 id="org7155f6b"><span class="section-number-2">6.</span> End of File</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">doc-md-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">doc-md-conf.el ends here</span>
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
